#+TITLE: March 20, 2019 - April 5, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-03-20 Wed>
  :wpd-akshay196: 1
  :wpd-jasonbraganza: 4
  :wpd-nightwarrior-xxx: 1.5
  :END:
** akshay196
*** The Hitchhiker's guide to Python [0/5]
    :PROPERTIES:
    :ESTIMATED: 17
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1553004553
    :TASKID: READ.1553004553
    :END:
    - [ ] Chapter 1. Picking an Interpreter           (30m)
    - [ ] Chapter 4. Writing Great Code [0/6]         ( 2h)
      - [ ] Code Style
      - [ ] Structuring Your Project
      - [ ] Testing your Code
      - [ ] Documentation
      - [ ] Logging
      - [ ] Choosing a License
    - [ ] Chapter 5. Reading Great Code [0/6]         ( 6h)
      - [ ] HowDoI
      - [ ] Diamond
      - [ ] Tablib
      - [ ] Requests
      - [ ] Werkzeug
      - [ ] Flask
    - [ ] Chapter 6. Shipping Great Code [0/5]        ( 4h)
      - [ ] Useful Vocabulary and Concepts
      - [ ] Packaging Your Code
      - [ ] Freezing Your Code
      - [ ] Packaging for Linux-Built Distributions
      - [ ] Exexutable ZIP Files
    - [ ] Chapter 7. User Interaction [0/3]          (4.5h)
      - [ ] Jupyter Notebooks
      - [ ] Command-Line Application
      - [ ] GUI Application
** jasonbraganza
*** IN_PROGRESS NIOS Maths Text Book - Part IV [1/9]
   :PROPERTIES:
   :ESTIMATED: 51
   :ACTUAL:   4.50
   :OWNER: jasonbraganza
   :ID: READ.1552291497
   :TASKID: READ.1552291497
   :END:
   :LOGBOOK:
   CLOCK: [2019-03-20 Wed 08:24]--[2019-03-20 Wed 12:54] =>  4:30
   :END:
    - [X] Module - II: Sequences and series [2/2]
      - [X] 6 - Sequences and series
      - [X] 7 - Some special sequences
    - [ ] Module - III: Algebra I [0/5]
      - [ ] 8 - Complex Numbers
      - [ ] 9 - Quadratic Equations and Linear Inequalities
      - [ ] 10 - Principle of Mathematical Induction
      - [ ] 11 - Permutations and Combinations
      - [ ] 12 - Binomial Theorem
    - [ ] Module - IV: Co-ordinate Geometry [0/4]
      - [ ] 13 - Cartesian System of Rectangular Co-ordinates
      - [ ] 14 - Straight Lines
      - [ ] 15 - Circles
      - [ ] 16 - Conic Sections
    - [ ] Module - V: Statistics and Probability [0/3]
      - [ ] 17 - Measures of Dispersion
      - [ ] 18 - Random Experiments and Events
      - [ ] 19 - Probability
    - [ ] Module - VI: Algebra II [0/3]
      - [ ] 20 - Matrices
      - [ ] 21 - Determinants
      - [ ] 22 - Inverse of a Matrix and its Applications
    - [ ] Module - VII: Relations and Functions [0/2]
      - [ ] 23 - Relations and Functions II
      - [ ] 24 - Inverse Trigonometric Functions
    - [ ] Module - VIII: Calculus [0/8]
      - [ ] 25 -  Limits and Continuity
      - [ ] 26 - Differentiation
      - [ ] 27 - Differentiation of Trigonometric Functions
      - [ ] 28 - Differentiation of Exponential and Logarithmic functions
      - [ ] 29 - Application of Derivatives
      - [ ] 30 - Integration
      - [ ] 31 - Definite Integrals
      - [ ] 32 - Differential Integrals
    - [ ] Module - IX: Vectors and Three Dimensional Geometry [0/4]
      - [ ] 33 - Introduction to Three Dimensional Geometry
      - [ ] 34 - Vectors
      - [ ] 35 - Plane
      - [ ] 36 - Straight Line
    - [ ] Module - X: Linear Programming and Mathematical Reasoning [0/2]
      - [ ] 37 - Linear Programming
      - [ ] 38 - Mathematical Reasoning
*** DONE NIOS Accounts Text Book - Part II [7/7]
    :PROPERTIES:
    :ESTIMATED: 16
    :ACTUAL:   14.67
    :OWNER: jasonbraganza
    :ID: READ.1552291636
    :TASKID: READ.1552291636
    :END:
    :LOGBOOK:
    CLOCK: [2019-03-26 Tue 09:58]--[2019-03-26 Tue 10:11] =>  0:13
    CLOCK: [2019-03-26 Tue 09:41]--[2019-03-26 Tue 09:58] =>  0:17
    CLOCK: [2019-03-26 Tue 08:51]--[2019-03-26 Tue 09:39] =>  0:48
    CLOCK: [2019-03-25 Mon 14:11]--[2019-03-25 Mon 16:33] =>  2:22
    CLOCK: [2019-03-25 Mon 11:00]--[2019-03-25 Mon 14:00] =>  3:00
    CLOCK: [2019-03-24 Sun 10:50]--[2019-03-24 Sun 14:06] =>  3:16
    CLOCK: [2019-03-23 Sat 10:00]--[2019-03-23 Sat 14:44] =>  4:44
    :END:
    - [X] Module - I: Basic Accounting [8/8]
      - [X] 1 - Accounting - An Introduction
      - [X] 2 - Accounting Concepts
      - [X] 3 - Accounting Conventions and Standards
      - [X] 4 - Accounting for Business Transactions
      - [X] 5 - Journal
      - [X] 6 - Ledger
      - [X] 7 - Cash Book
      - [X] 8 - Special Purpose Books
    - [X] Module - II: Trial Balance and Computers [5/5]
      - [X] 9 - Trial Balance
      - [X] 10 - Bank Reconciliation Statement
      - [X] 11 - Bills of Exchange
      - [X] 12 - Errors and their Rectification
      - [X] 13 - Computer and Computerised Accounting System
    - [X] Module - III: Financial Statements [8/8]
      - [X] 14 - Depreciation
      - [X] 15 - Provision and Reserves
      - [X] 16 - Financial Statements - An Introduction
      - [X] 17 - Financial Statements I
      - [X] 18 - Financial Statements II
      - [X] 19 - Not for Profit Organisations - An Introduction
      - [X] 20 - Financial Statements (Not for Profit Organisations)
      - [X] 21 - Accounts From Incomplete Records
    - [X] Module - IV: Partnership Accounts [4/4]
      - [X] 22 - Partnership - An Introduction
      - [X] 23 - Admission of a Partner
      - [X] 24 - Retirement and Death of a Partner
      - [X] 25 - Dissolution of a partnership firm
    - [X] Module - V: Company Accounts [5/5]
      - [X] 26 - Company - An Introduction
      - [X] 27 - Issue of Shares
      - [X] 28 - Forfeiture of Shares
      - [X] 29 - Reissue of Forfeited Shares
      - [X] 30 - Issue of Debentures
    - [X] Module - VI : Analysis of Financial Statements [4/4]
      - [X] 31 - Financial Statements Analysis-An Introduction
      - [X] 32 - Accounting Ratios-I
      - [X] 33 - Accounting Ratios-II
      - [X] 34 - Cash Flow Statement
    - [X] Module - VII: Application of Computers in Financial Accounting [4/4]
      - [X] 35 - Electronic Spread Sheet
      - [X] 36 - Use of Spread-sheet in Business Application
      - [X] 37 - Graphs and Charts for Business
      - [X] 38 - Database Management System for Accounting
** nightwarrior-xxx
*** [#A] Innovate and Build [0/1]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1552081239
    :TASKID: DEV.1552081239
    :END:
    - [ ] Password Manager in Lua programming lanaguage
    - [ ] Making life easy in lua programming langugage
*** [#A] Learn concepts of Lua [0/2]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1552081129
    :TASKID: READ.1552081129
    :END:
    - [ ] Treating the arguments
    - [ ] Applying the trie algo on arguments
*** [#B] JavaScript 30 [0/9] 
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1553024585
    :TASKID: DEV.1553024585
    :END:
    - [ ] Javascript Drum Kit
    - [ ] CSS + JS clock
    - [ ] Playing with JS variable and CSS
    - [ ] Array Cardio day
    - [ ] Flex panel image gallery
    - [ ] Ajax type ahead
    - [ ] Fun with canvas
    - [ ] Array Cardio day 2
    - [ ] 14 must know dev tools tricks
*** [#B] Learn React [0/10]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1552139317
    :TASKID: DEV.1552139317
    :END:
    - [ ] Understanding the Base Features & Syntax
    - [ ] Working with Lists and Conditionals
    - [ ] Styling React Components & Elements
    - [ ] Debugging React Apps
    - [ ] Diving Deeper into Components & React Internals
    - [ ] A Real App_ The Burger Builder (Basic Version)
    - [ ] Reaching out to the Web (Http _ Ajax)
    - [ ] Burger Builder Project_ Accessing a Server
    - [ ] Multi-Page-Feeling in a Single-Page-App_ Routing
    - [ ] Adding Routing to our Burger Project

